Revit 2026 API

# TileTileEdgeRoughness Property

---

The property labeled "Roughness" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileEdgeRoughness { get; }
```
```vb
Public Shared ReadOnly Property TileEdgeRoughness As String
	Get
```
```cpp
public:
static property String^ TileEdgeRoughness {
	String^ get ();
}
```
```fsharp
static member TileEdgeRoughness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 200".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace